{
  "1710.03211v2": {
    "title": "Behavioral Finance -- Asset Prices Predictability, Equity Premium Puzzle, Volatility Puzzle: The Rational Finance Approach",
    "authors": [
      "Svetlozar Rachev",
      "Stoyan Stoyanov",
      "Stefan Mittnik",
      "Frank J. Fabozzi",
      "Abootaleb Shirvani"
    ],
    "summary": "In this paper we address three main objections of behavioral finance to the\ntheory of rational finance, considered as anomalies the theory of rational\nfinance cannot explain: Predictability of asset returns, The Equity Premium,\n(The Volatility Puzzle. We offer resolutions of those objections within the\nrational finance. We do not claim that those are the only possible explanations\nof the anomalies, but offer statistical models within the rational theory of\nfinance which can be used without relying on behavioral finance assumptions\nwhen searching for explanations of those anomalies.",
    "pdf_url": "http://arxiv.org/pdf/1710.03211v2",
    "published": "2017-10-09"
  },
  "2009.08668v1": {
    "title": "International Trade Finance from the Origins to the Present: Market Structures, Regulation and Governance",
    "authors": [
      "Olivier Accominotti",
      "Stefano Ugolini"
    ],
    "summary": "This chapter presents a history of international trade finance - the oldest\ndomain of international finance - from its emergence in the Middle Ages up to\ntoday. We describe how the structure and governance of the global trade finance\nmarket changed over time and how trade credit instruments evolved. Trade\nfinance products initially consisted of idiosyncratic assets issued by local\nmerchants and bankers. The financing of international trade then became\nincreasingly centralized and credit instruments were standardized through the\ndiffusion of the local standards of consecutive leading trading centres\n(Antwerp, Amsterdam, London). This process of market centralization/product\nstandardization culminated in the nineteenth century when London became the\nglobal centre for international trade finance and the sterling bill of exchange\nemerged as the most widely used trade finance instrument. The structure of the\ntrade finance market then evolved considerably following the First World War\nand disintegrated during the interwar de-globalization and Bretton Woods\nperiod. The reconstruction of global trade finance in the post-1970 period gave\nway to the decentralized market structure that prevails nowadays.",
    "pdf_url": "http://arxiv.org/pdf/2009.08668v1",
    "published": "2020-09-18"
  }
}